CSI API ETABS v1
cFile.ExportFile Method
 Exports the present model to file.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ExportFile(
	string FileName,
	eFileTypeIO FileType
)
Function ExportFile (
	FileName As String,
	FileType As eFileTypeIO
) As Integer
Dim instance As cFile
Dim FileName As String
Dim FileType As eFileTypeIO
Dim returnValue As Integer
returnValue = instance.ExportFile(FileName,
	FileType)
int ExportFile(
	String^ FileName,
	eFileTypeIO FileType
)
abstract ExportFile :
        FileName : string *
        FileType : eFileTypeIO -> int
Parameters
FileName
Type: System.String
The full path of a model file to be exported in the application.
FileType
Type: ETABSv1.eFileTypeIO
 This is an item from the eFileTypeIO enumeration.
TextFile
DBTablesExcel
DBTablesAccess
DBTablesText
DBTablesXML
Return Value
Type: Int32
 Returns zero if the file is successfully opened and nonzero if it is not opened.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim FileName as String
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'Create steel deck template model
       ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
       Dim FileName As String
       Dim FileType As eFileTypeIO
       FileName = "c:\CSI_API_temp\example.e2k"
       FileType = eFileTypeIO.DBTablesExcel
       ret = SapModel.File.ExportFile(FileName, FileType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace